["Announcement: Mediusware Employee Representative Committee (ERC) Dear Team, We are excited to introduce the Mediusware Employee Representative Committee (ERC)—a platform dedicated to fostering collaboration, positivity, and growth within our organization. Meet Your Representatives:  TPM: Rafeu Riyan, Fazal Mahmud Hasan  Laravel Department: Shahriar Rahat  JavaScript: Sarfaraz Mohammad Sajib  WordPress: Zahid Uddin  UI/UX: Md. Asadullah Tuhin  Python: Md. Sakib Rahman Purpose and Goals: 1. Employee Representation: These representatives are here to listen to your thoughts, concerns, and suggestions. 2. Monthly Meetings: The ERC will hold monthly meetings with office management, accompanied by special snacks, to share feedback and ideas. 3. Positive Collaboration: The committee will focus on proposing actionable and positive improvements to management for a better workplace. Communication Etiquette: We encourage all employees to channel any concerns or suggestions through their", "by special snacks, to share feedback and ideas. 3. Positive Collaboration: The committee will focus on proposing actionable and positive improvements to management for a better workplace. Communication Etiquette: We encourage all employees to channel any concerns or suggestions through their respective department leads or TPM. Let’s avoid spreading negativity on public platforms like Skype. Instead, use this new initiative to discuss and resolve matters constructively. We believe this step will strengthen communication and create a more harmonious and productive environment for everyone. Together, let’s build a brighter future for Mediusware! Warm regards, Mediusware Management 24/1 & 24/2,TajmahalRoad, Mohammadpur, Dhaka-1207 +8801750020408 www.mediusware.com", "Happy Holidays! National Holidays-2025 NAME OF THE HOLIDAY International Mother Language Day Independence Day Laylat al-Qadr* Eid-ul-Fitr* Pohela Baishakh May Day Eid-ul-Adha* Eid-e-Milad-un-Nabi (SAW)* Durga Puja (Bijaya Dashami) Victory Day Christmas Day Date February 21, 2025 March 26, 2025 March 28, 2025 March 29 - April2, 2025 April 14, 2025 May 1, 2025 June 5 - June 10,2025 September 5, 2025 October 1 - 2 2025 December 16, 2025 December 25, 2025 Days Friday Wednesday Friday Saturday-Wednesday Monday Thursday Thursday - Tuesday Friday Wednesday - Thursday Tuesday Tuesday Remarks 1 Day 1 Days 1 Day 5 Days 1 Days 1 Day 6 Day 1 Day 2 Day 1 Days 1 Day *The date may change depending on the moon's appearance.", "Mediusware Ltd. All Learning Resources Coursera: https://www.coursera.org Email- shaheenmediusware@gmail.com Password- wBx6T/pP|V;p _____________________________________________________________________ Drive link: https://drive.google.com/drive/folders/1PAGq2x0z0UrNsicjaUX2rtq0h7FyLNEO?usp =sharing _____________________________________________________________________", "Subject: Clarification of Casual and Medical Leave Policy Dear Team, This is to clarify our leave policy at Mediusware Ltd. For Casual Leave, requests must be submitted by 6:00 PM on the last working day before the leave date. Medical Leave requires a registered doctor's prescription as proof of illness. We appreciate your cooperation. For any questions or further clarification, please contact the HR department. Best regards, HR Executive Mediusware Ltd. 24/1, 7th & 8th Floor, Ring Road, Mohammadpur, Dhaka-1207 +8801750020408 www.mediusware.com Membership no-AS-21-11-074", "Mediusware Limited About Mediusware Limited EMPLOYEE SERVICE GUIDELINE Version 2.0 Prepared by: Mediusware Limited. Address: 24/1, Tajmohol Road, Ring Road, Sia mashjid mor, Mohammadpur, Dhaka-1207 Email: hr@mediusware.com Who We Are Incepted in 2015, Mediusware Ltd. has been serving as a leading IT Solution provider in Bangladesh. Our aim is to help businesses all around the world by providing the digital solutions according to their need. Serving a number of renowned companies from the USA, UK, and many other countries, we have already created a wide range of satisfied clients! Why Mediusware Mediusware mounts its vast expertise, superior technical skills, and highest quality support services to provide scalable IT solutions to its clients. Our Milestone of satisfying 1000+ global clients shows our expertise and dedication to provide our clients with highest class digital services and solutions. Our Mission Leave a positive footprint by devoting our human resources, technologies and", "to provide scalable IT solutions to its clients. Our Milestone of satisfying 1000+ global clients shows our expertise and dedication to provide our clients with highest class digital services and solutions. Our Mission Leave a positive footprint by devoting our human resources, technologies and expertise to deliver top-of-the-line digital products, thereby contributing to the success of modern businesses around the globe. Our Vision Deliver one-of-a-kind digital solutions to facilitate global businesses, powered by innovation and guided by integrity.", "Introduction After completing the interview process, signing contracts, and arriving at Mediusware Limited, congratulations are in order, and a warm welcome awaits you. Mediusware Limited boasts a distinctive approach that promises to transform this into the most enriching professional experience of your life, albeit one that may require some adjustment. Let's embark on this journey together. 2.1. Summary This employee service guideline establishes formal rules and procedures governing the appropriate handling of various matters in the workplace, encompassing the rights and duties of both employees and employers. Aligned primarily with Bangladesh Labor law, these policies are crucial to ensure compliance and avoid penalties imposed by the government. Intended for all employees of Mediusware Limited, this guideline serves as a convenient reference for the terms, conditions, and benefits of employment. It outlines our philosophies and benefits, delineates general obligations during your", "compliance and avoid penalties imposed by the government. Intended for all employees of Mediusware Limited, this guideline serves as a convenient reference for the terms, conditions, and benefits of employment. It outlines our philosophies and benefits, delineates general obligations during your tenure with Mediusware Limited, and extends to certain responsibilities even after separation. It is imperative to thoroughly review all sections, as this document constitutes an integral component of your employment contract with Mediusware Limited, alongside your employment letter. Please note that Mediusware Limited retains the right to modify the terms and conditions outlined in this Handbook or your employment letter at its discretion. This employee service guideline remains the property of Mediusware Limited. 2.2. Compliance with National Digital Security Act 2018 Every employee at Mediusware Limited is required to adhere to the national digital security regulations outlined in the 2018", "your employment letter at its discretion. This employee service guideline remains the property of Mediusware Limited. 2.2. Compliance with National Digital Security Act 2018 Every employee at Mediusware Limited is required to adhere to the national digital security regulations outlined in the 2018 Bangladesh law. This legislation is designed to address the need for an Act that ensures national digital security and establishes laws pertaining to the identification, prevention, suppression, trial, and other relevant aspects of digital crime.", "2.3. Confidentiality All personnel across various departments within the organization are obligated to maintain the confidentiality of business-related information. Employees must safeguard their passwords and refrain from transmitting sensitive or confidential messages through email. Engaging in visits to unlawful or inappropriate websites, participating in chats, and playing games are strictly prohibited. Throughout the duration of employment, employees are prohibited from having any direct or indirect involvement in any business, trade, or profession associated with the organization and must strictly adhere to the employment code of conduct It is imperative for employees to ensure the confidentiality of financial information, including project budgets, costs, personal salary details, and the salaries of other employees. Furthermore, employees are strictly prohibited from disclosing, either directly or indirectly, any knowledge or information acquired in relation to the company's", "confidentiality of financial information, including project budgets, costs, personal salary details, and the salaries of other employees. Furthermore, employees are strictly prohibited from disclosing, either directly or indirectly, any knowledge or information acquired in relation to the company's affairs, property, business, trade matters, and confidential secrets to any individual or organization. 2.4. Equal Employment Opportunity Mediusware Limited upholds the principles and objectives of all local employment laws, demonstrating a firm commitment to ensuring equal employment opportunities. The company pledges not to discriminate against any employee or applicant in a manner that contravenes the law. Mediusware Limited is dedicated to providing equal opportunities for all employees and applicants, regardless of race, color, religion, national origin, sex, age, marital status, sexual orientation, disability, political affiliation, personal appearance, family responsibilities,", "the law. Mediusware Limited is dedicated to providing equal opportunities for all employees and applicants, regardless of race, color, religion, national origin, sex, age, marital status, sexual orientation, disability, political affiliation, personal appearance, family responsibilities, matriculation, or any other characteristic protected under federal, state, or local law. Each individual is assessed based on personal skills and merit. Mediusware Limited's policy on equal employment opportunity extends to all facets of employment, encompassing recruitment, hiring, job assignments, promotions, working conditions, scheduling, benefits, wage and salary administration, disciplinary action, termination, as well as social, educational, and recreational programs.", "Employment & Remuneration 3.1. Probation Period Upon joining Mediusware Limited, the initial 3 months of your employment will constitute a probationary period. Throughout this period, your progress will be monitored, and a comprehensive performance appraisal will be conducted. Depending on your performance, the probation period may be extended for an additional three months. However, under any circumstance, the total probationary period will not exceed sixmonths. Upon receiving a satisfactory appraisal, you will be issued a confirmation appointment letter. In the event of an unsatisfactory appraisal, there may be consideration for an extension of the probationary period, during which another appraisal will occur within the subsequent six months. Following this period, a decision will be made regarding your continued employment with Mediusware Limited. Successful completion of the probationary period will result in employees being designated as permanent staff. 3.2. Remuneration Your", "appraisal will occur within the subsequent six months. Following this period, a decision will be made regarding your continued employment with Mediusware Limited. Successful completion of the probationary period will result in employees being designated as permanent staff. 3.2. Remuneration Your method of receiving payment will involve the direct transfer or issuance of an account payee cheque or cash, with the gross monthly salary reduced by deductions such as tax and provident fund contributions. Payments will be made to your bank account, and payday for all employees is scheduled for the first week of the subsequent month. 3.3. Salary Components The primary components of the gross salary include: a. Basic salary (55% of gross) b. House rent c. Medical allowance d. Provident fund (if applicable) e. Conveyance f. Other allowances g. Performance bonus", "Deductions consist of various components as outlined below: a. Income tax b. Company and employee provident fund contributions (if applicable) c. Loan deductions d. Other deductions – these may arise from unauthorized leave or late attendance, among other reasons. 3.4. Festival Bonus The festival bonus is exclusively disbursed to Permanent Staff Members. Eligibility for 100% of this bonus requires employees to complete twelve months or one year of service with the company. Employees of all religions will be entitled to receive two bonuses annually, each amounting to 100% of Their Basic Monthly Salary. Additionally we give festival bonus (only permanent ) according to the below format: Months Bonus 3 to 4 20% Basic 5 to 6 40% Basic 7 to 8 60% Basic 9 to 10 80% Basic 11 90% Basic 12 100% Basic 3.5. Calculation of Monthly Salary Your monthly salary will be specified in your employment offer letter. Upon joining Mediusware Limited, the computation of your first month's pay will be", "Months Bonus 3 to 4 20% Basic 5 to 6 40% Basic 7 to 8 60% Basic 9 to 10 80% Basic 11 90% Basic 12 100% Basic 3.5. Calculation of Monthly Salary Your monthly salary will be specified in your employment offer letter. Upon joining Mediusware Limited, the computation of your first month's pay will be determined by the commencement date and will be as follows: A. If you commence on the first working day of the month, you will receive a full month's pay.", "B. If your start date is after the first working day of the month, your first month's salary will be calculated by dividing The Number of Days Worked by the number of Working Days in the Month, multiplied by your monthly salary. C. In the event of leaving Mediusware Limited before the last working day of the month, the calculation will follow the method outlined in point b. 3.6. Tax and Other Deductions Since personal taxation is deducted at the source in Bangladesh, Mediusware Limited will deduct taxes as required by the tax laws. It is the responsibility of employees to file their own tax returns with the tax authorities. 3.7. Provident Fund Deductions Employees have the option to participate in the company's Provident Fund Scheme (PFS) starting from the date of job confirmation. 3.8. Increment Policy Employees at Mediusware are eligible for salary increments every Six Months, contingent on Satisfactory Performance Evaluations. Increments are calculated based on individual and", "in the company's Provident Fund Scheme (PFS) starting from the date of job confirmation. 3.8. Increment Policy Employees at Mediusware are eligible for salary increments every Six Months, contingent on Satisfactory Performance Evaluations. Increments are calculated based on individual and company performance. Communication of increments will occur after evaluations, with exceptions possible for outstanding achievements. The company reserves The Right to Modify The Policy, and approval for any changes is required.", "Employee Performance Appraisal System 4.1. Overview Appraisal systems assess employee performance by comparing it to pre-established goals, establishing future objectives, and providing guidance on developmental and training requirements. These systems assist managers in recognizing both accomplishments and areas for improvement, offering a framework to guide ongoing enhancements. 4.2. Performance Rating Rating Labels Range 01 Excellent / Role model / Outstanding 80% and above 02 Exceed Expectation 70% and above 03 Meets Expectation 60% and above 04 Need Improvement Less than 60% 05 Unacceptable Less than 40% 4.3. Performance Rating Evaluation Criteria No of Factors Scores 01 Core Competency 8 32 Points 02 Attitude 7 28 Points 03 Work Practice 6 24 Points 04 Discipline 4 16 Points Total 100 Points", "Daily & Monthly Work Time Particulars Start Hour End Hour Duration 01 General Office Operating Hour 10.00 AM 11.00 PM 13.00 02 Regular Work Hour 11.00 AM 8.00 PM 09.00 03 Lead/Manager Entry 12.00 PM 9.00 PM 09.00 5.2. Breaks Particulars Start Hour End Hour Duration 01 Prayer & Lunch Break 02.00 PM 2:45 PM 45 Mins 02 Prayer Break (Asar) - - 15 Mins 03 Prayer (Magrib) & Tea Break - - 15 Mins Total 1 Hr 15 Mins Weekends & Holidays 6.1. Weekly Day Off : Every Saturday & Sunday. 6.2. List of Holidays : As per Bangladesh Govt holidays 6.3. Terms for Holidays Mediusware Limited reserves the authority to cancel or adjust a holiday, whether for an individual or the entire organization, as deemed necessary.", "Leave Policy & Procedure 7.1. Objective Mediusware Limited reserves the right to cancel or readjust a holiday based on requirements, whether for an individual or the entire organization. 1. Mediusware Limited's business year aligns with the financial year, running from January 1 to December 31. 2. Ensure the timely submission of reports and maintain accurate absence records. 3. Establish a framework for the administration and approval of leaves. 4. Effectively manage absences in accordance with entitlements. 5. Furnish employees with clear and consistent information regarding the various types of leaves they may be entitled to, along with the company's new code of conduct, rules, and regulations regarding leave. 6. Promote a fair approach to assist employees in balancing their domestic and work responsibilities. 7. Provide information and guidance for managers handling leave requests. 7.2. Leave Year & Types Leave year will be considered from 1st January of year to 31st December of", "regarding leave. 6. Promote a fair approach to assist employees in balancing their domestic and work responsibilities. 7. Provide information and guidance for managers handling leave requests. 7.2. Leave Year & Types Leave year will be considered from 1st January of year to 31st December of year. To be eligible for leave, employees must apply by following the company's leave application system. Types of Leaves: 1. Sick Leave. 2. Casual Leave. 3. Maternity Leave. 4. Paternity Leave. 5. Leave in Probation/Intern Period.", "7.3. Casual Leave 1. Purpose of Casual Leave: a. Intended for unforeseen and emergency needs. b. Situations that cannot be planned in advance. 2. Maximum Duration: a. Employees can take a Maximum of 3 Consecutive casual leave days. 3. Extended Casual Leave: a. If casual leave exceeds 3 days. b. Leave request must be submitted at least one week (7 days) in advance. 4. Leave Request Conditions: a. Proper explanation required for extended casual leave. b. If conditions are not met, management retains the right to deny the request. 5. Entitlement: a. Employees are entitled to 14 Days of Casual Leave per leave year. 6. Transferability: a. Casual leaves are non-transferable. 7. Compensation for Unused Leave: a. Any remaining unused casual leave will be Compensated as Leave Encashment at the conclusion of the leave year. 7.4. Sick Leave 1. Entitlement: a. Permanent employees are entitled to a total of 8 days of paid sick leave. - Submission of Medical Documents by BMDC Registered Doctors is", "Leave: a. Any remaining unused casual leave will be Compensated as Leave Encashment at the conclusion of the leave year. 7.4. Sick Leave 1. Entitlement: a. Permanent employees are entitled to a total of 8 days of paid sick leave. - Submission of Medical Documents by BMDC Registered Doctors is Mandatory for sick leave approval. - Failure to provide medical documents will result in the leave being Treated as Casual Leave or Non-Paid, subject to HR operations investigation.", "2. Carry Forward Explanation: a. If an employee takes 4 days of sick leave: - 4 days will be carried forward to the next year at the end of the current year. 7.5. Maternity & Paternity Leave 1. Maternity Leave Entitlement: This provision is designed for female staff members who are pregnant and expecting childbirth. a. Maternity leave is granted after completing one year as a permanent employee. b. Employees must inform the HR department of the probable leave at least 3 months in advance before taking the leave. c. A maximum of 4 weeks of paid leave is entitled. d. An option for leave without pay is available for a maximum of 3 months. 2. Paternity Leave Entitlement: This leave is intended for employees who have or anticipate responsibilities for the upbringing of their child and are either the biological father of the baby or the mother's husband or partner. a. A total of 3 working days of paternity leave is allowed (5 days in total, including weekends). b. Paternity leave is", "for employees who have or anticipate responsibilities for the upbringing of their child and are either the biological father of the baby or the mother's husband or partner. a. A total of 3 working days of paternity leave is allowed (5 days in total, including weekends). b. Paternity leave is exclusively for permanent employees of the organization. c. Notification of probable leave must be given at least 4 weeks before the expected week of childbirth. 3. Clarification for maternity & paternity leave: If someone has already 1 child before joining, he or she will be eligible for 1 child during his period of job. If someone already has 2 children before joining she or he will not be eligible for this benefits.", "7.6. Leave in Probation/Intern Period 1. Leave Restriction for Probationary Employees: - Full-time employees not yet confirmed cannot avail themselves of any paid leave during the probation period. 2. Leave Allowance and Limits During Probation: - During the probation period, employees are entitled to 3 Paid Leaves (1 Casual Leave and 2 Sick Leave). - Any leave taken outside this period will be considered \"Leave Without Pay.\" - A maximum of 10 days of leave (paid and unpaid) is allowed during the probation period, with a limit of one leave per month. 3. Leave Application Process: - Employees are required to submit leave applications through the company's leave application system. 7.7. Important Rules 1. General: a. At the end of the month, if a leave is not approved (whether not applied or applied but rejected) and no attendance data is available, it will be treated as unpaid leave. b. Salary deduction for unpaid leaves will be based on the gross/22 rate c. If a leave application is", "Rules 1. General: a. At the end of the month, if a leave is not approved (whether not applied or applied but rejected) and no attendance data is available, it will be treated as unpaid leave. b. Salary deduction for unpaid leaves will be based on the gross/22 rate c. If a leave application is not approved or rejected by the admin/PM within 3 days, it will be automatically approved. d. The administration retains the full right to approve or deny a leave application. e. Leave applications must be Submitted Through HR System, including a filled leave application form with detailed reasons attached. The casual leave email must be submitted & discussed at office within 3 pm. Outside office only medical and unpaid leaves will be considered. It's important to note that the main body of the email should not be empty. The leave will only be counted once Team Lead/HR provides approval; otherwise, it will be considered unpaid leave.", "2. Client Approval: a. Employees directly engaged with clients must obtain leave approval from the client before applying for leave. If the client approves the leave, the employee can proceed with the leave application through the established procedure. Leave requests will be denied if the client rejects them. 3. Team Communication: a. Employees are responsible for ensuring that their team members are well- informed about their upcoming leave(s). b. Once the leave application is approved, it is recommended to forward the approval email to team members. 4. Working from Home: a. In unavoidable scenarios, employees can apply for \"Work from Home. b. While working from home, time tracking applications must be active. Absence of attendance and time tracking logs will result in the work-from-home days being considered as unpaid leave. 5. Overtime Policy: a. If employees are required to work a full day (minimum 7 hours) on a holiday or weekend, it will be treated as full-day overtime. For 4 to", "must be active. Absence of attendance and time tracking logs will result in the work-from-home days being considered as unpaid leave. 5. Overtime Policy: a. If employees are required to work a full day (minimum 7 hours) on a holiday or weekend, it will be treated as full-day overtime. For 4 to 6 hours, it will be considered a half-day. b. Employees need to apply for overtime to HR or Accounts to avail of it. Payment will be made at the below equation: Overtime salary per day = (Gross Salary/Number of days in month)x2 6. Encashment Policy: Encashment will be always in the End of Leave year. Encashment will be applied only Casual Leave. The equation will be below: Encashment Salary Per Day = Gross Salary / 31 ( One day salary)", "Disciplinary Rules and Appeal Procedure Employees possess the right to be acquainted with the disciplinary rules and procedures applicable to all members of Mediusware Limited's workforce. This section serves as a comprehensive guide for employees regarding the processes involved in addressing disciplinary issues. In any organization, rules and regulations are essential to underscore commonly accepted behavior that applies to society at large. It is imperative that employees have a thorough understanding of these rules and procedures, and a fair warning will precede any disciplinary action. 8.1. Disciplinary Procedure 1. The company should file a written complaint, providing the employee with a copy of the complaint letter. 2. A committee, consisting of employer and employee representatives, must be formed. 3. A hearing session will be conducted to address the complaint. If the committee finds the employee guilty, the employer reserves the right to terminate the employment. 8.2. Types", "a copy of the complaint letter. 2. A committee, consisting of employer and employee representatives, must be formed. 3. A hearing session will be conducted to address the complaint. If the committee finds the employee guilty, the employer reserves the right to terminate the employment. 8.2. Types of Disciplinary Action 1. In certain circumstances where misconduct amounts to a breach of responsibility or failure to meet accepted standards, management may demote and/or transfer the individual to other duties. 2. Dismissal, being the ultimate sanction (aside from civil or criminal suits), is expected to be employed sparingly. It may be invoked when the employee's record does not show improvement after reasonable warnings, as outlined in the section where a single offense makes continued employment with Mediusware Limited untenable. 3. Employees will receive a written explanation for their dismissal.", "Separation Policy Either the employee or Mediusware Limited may initiate separation. Mediusware Limited encourages employees, especially permanent ones, to submit a written notice at least 60 days before the intended separation. Following the receipt of such notice, the HR or their designate will arrange an exit interview. The HR holds the authority to either retain or separate all other employees. Separation may occur under various circumstances, including: 9.1. Resignation 1. Employees are Advised to Provide a Minimum of 60 days' written notice. To allow for a more extended period, it is preferable to communicate the intention to resign as early as possible. 2. Failing to give a minimum of 30 days' notice before leaving the organization will result in a Deduction of one Months Gross Salary. To avoid any complications during the separation process, employees must compensate for this deduction. 3. Employees who resign are not entitled to receive accrued, unused vacation benefits &", "of 30 days' notice before leaving the organization will result in a Deduction of one Months Gross Salary. To avoid any complications during the separation process, employees must compensate for this deduction. 3. Employees who resign are not entitled to receive accrued, unused vacation benefits & leaves 9.2. Termination or Lay-off Under certain circumstances, the termination or lay-off of an employee may become necessary. Employees who face termination or lay-off are not entitled to receive accrued, unused vacation benefits. Grounds for discharge may include, but are not limited to: 1. Providing false or withholding information on the employment application that would have impacted Mediusware Limited's decision to hire (resulting in immediate termination). 2. Falsifying or withholding information in other personnel records, including personnel questionnaires, performance evaluations, or any other records. 3. Subpar performance at work or failure to perform assigned duties at a level", "Limited's decision to hire (resulting in immediate termination). 2. Falsifying or withholding information in other personnel records, including personnel questionnaires, performance evaluations, or any other records. 3. Subpar performance at work or failure to perform assigned duties at a level acceptable to Mediusware Limited. 4. Failure to complete required time records or falsification of such time records. 5. Unapproved and unreasonable absence from the office.", "6. Refusal to carry out a reasonable instruction. 7. Work not meeting the required standard due to negligence. 8. Failure to meet minor financial commitments. 9. Disregarding the \"Agreement for Confidentiality. 10. Behavior detrimental to the reputation of Mediusware Limited. 11. Conviction for a criminal offense. 12. Theft from Mediusware Limited, another employee, or any other person on the premises. 13. Damaging property belonging to Mediusware Limited, other employees, or any other person. 14. Assault on any person on the premises or another employee at any time. 15. Engaging in fraudulent practices. 16. Use of extreme bad language or profanity. 17. Drunkenness, using, handling, or possessing illegal drugs, or any similar offense. 18. Involvement in sexual harassment. 19. Accepting bribes. 20. Displaying gross negligence, insubordination, or misconduct. 21. Bankruptcy or failure to meet financial commitments causing loss to Mediusware Limited or tarnishing the company's name. 22.", "illegal drugs, or any similar offense. 18. Involvement in sexual harassment. 19. Accepting bribes. 20. Displaying gross negligence, insubordination, or misconduct. 21. Bankruptcy or failure to meet financial commitments causing loss to Mediusware Limited or tarnishing the company's name. 22. Dismissal, as the ultimate sanction (other than a civil or criminal suit), is expected to be used sparingly. However, it may be invoked when an employee's record does not improve after reasonable warnings, as outlined in the paragraph where a single offense makes continued employment with Mediusware Limited impossible. 23. Employees will be provided with a written explanation for their dismissal. When differentiating between a serious breach and a breach of general discipline, management will consider the facts of the case and whether one or more offenses have been committed.", "Intellectual Rights and Copyright During the tenure of employment with Mediusware Limited, any inventions, designs, programs, research papers, and findings created by the employee shall exclusively belong to Mediusware Limited. Employees involved in such endeavors shall have no rights whatsoever over these items. Complaints, Grievances, and Suggestions Mediusware Limited acknowledges that employees may have complaints and grievances from time to time. In instances where these issues cannot be resolved amicably at an early stage, employees should have the opportunity to seek resolutions. 11.1. Personal Problems If you have confidential personal problems that you do not wish to discuss with your supervisor, you may directly consult with HR or email hr@mediusware.com. 11.2. Suggestions Employees are encouraged to share suggestions if they have ideas that they believe will enhance work performance or conditions. These suggestions should be discussed with their supervisor or emailed to", "your supervisor, you may directly consult with HR or email hr@mediusware.com. 11.2. Suggestions Employees are encouraged to share suggestions if they have ideas that they believe will enhance work performance or conditions. These suggestions should be discussed with their supervisor or emailed to hr@mediusware.com.", "Return of Property Employees are accountable for the care of Mediusware Limited's equipment, property, and work products issued to them or in their possession or control. This includes, but is not limited to: 1. Telephone cards. 2. Credit cards. 3. Identification badges. 4. Office/building keys. 5. Office/building security passes. 6. Computers, computerized diskettes, electronic/voice mail codes. 7. Intellectual property (e.g., written materials, work products). 8. Office ID card and lanyard. Change of Personal Information It is crucial to notify HR of any personal changes, such as: 1. Address or telephone number. 2. Name change or marital status. 3. Gain or loss of dependents. 4. New qualifications.", "Work Practice During their day-to-day activities at Mediusware, it is imperative for employees to adhere to the organizational work practices and culture. 14.1. Brand Guidelines All employees are required to strictly adhere to the brand guidelines. This includes maintaining the use of organizational logos, colors, fonts, email signatures, etc., in accordance with the brand guidelines. 1. Strict compliance with brand guidelines is mandatory for all employees, and failure to do so may result in lower points in the Key Performance Indicator (KPI). 2. The use of organization logos, colors, fonts, email signatures, etc., should align with the specifications outlined in the brand guidelines. 14.2. Data Backup 1. Employees must ensure that all project data and relevant information are regularly backed up, with a minimum frequency of once a month. 2. Ongoing projects should be backed up weekly, using a cloud location designated by the organization and a physical drive provided by the company.", "Data Backup 1. Employees must ensure that all project data and relevant information are regularly backed up, with a minimum frequency of once a month. 2. Ongoing projects should be backed up weekly, using a cloud location designated by the organization and a physical drive provided by the company. 3. Data backups must include working, virus-free source code/source files and be appropriately named with the version number. 4. Git must be utilized for version control in design and development projects. 14.3. Task Management Application 1. Mediusware employs Trello as its default task management application, and it is mandatory for employees to use Trello for task management. Project hours should be logged using Plus for Trello. 2. Different task management applications may be required based on project requirements.", "3. The total hours logged in a task management application will significantly contribute to performance evaluation. 14.4. Communication 1. Skype serves as the default communication tool within Mediusware, and employees are required to have a Skype ID created. 2. For both internal and external communications, all employees must use their organizational email addresses. 3. Web accounts should be registered using the organization's email address, and credentials must be shared with hr@mediusware.com. 4. It is of utmost importance that communication is executed appropriately and clearly conveyed to both clients and team members. 14.5. Workplace Environment 1. Maintaining a clean and organized workspace is crucial. 2. Employees are encouraged to minimize noise levels as much as possible during work hours. 3. Demonstrating respect towards coworkers is paramount, and any form of misbehavior towards team members, employees, or clients will be considered a serious violation of the code of", "workspace is crucial. 2. Employees are encouraged to minimize noise levels as much as possible during work hours. 3. Demonstrating respect towards coworkers is paramount, and any form of misbehavior towards team members, employees, or clients will be considered a serious violation of the code of conduct 4. Conserving paper, electricity, and water is advocated, as every saved unit contributes to a better future for the world.", "General Expectations 15.1. Dress Code & Uniform Mediusware Limited anticipates its employees to maintain a smart appearance during working hours, avoiding extreme fashions in both dress and hairstyle. All employees are required to adhere to a business casual dress code during office hours. Additionally, specific staff members may be mandated to wear a uniform provided by Mediusware Limited while on duty. All employees must have to hang their own employee ID card. 15.2. Drugs With the exception of drugs prescribed by medical practitioners or mild drugs available over-the-counter from chemists, employees are not allowed to bring drugs into Mediusware Limited or consume drugs on the company’s premises. 15.3. Gifts Employees are strongly discouraged from accepting any gifts from clients or external entities, regardless of the value. 15.4. Mediusware Fraternization Policy: Mediusware maintains a professional work environment and expects employees to refrain from Engaging in romantic or", "premises. 15.3. Gifts Employees are strongly discouraged from accepting any gifts from clients or external entities, regardless of the value. 15.4. Mediusware Fraternization Policy: Mediusware maintains a professional work environment and expects employees to refrain from Engaging in romantic or familial relationships with colleagues that may affect workplace dynamics. Any such relationships should be disclosed to HR, and management may take appropriate measures to address potential conflicts of interest. Non-compliance with this policy may result in disciplinary action, up to and including termination.", "Non-Solicitation Clause 1. Every employee shall conform to and abide by these rules and shall observe, comply with and obey orders and directions of his/her superiors under whose supervision or control he/she may be placed. Observance of rules and regulations as enforced from time to time is a primary condition of employment. 2. No employee can reach/engaged any clients over any personal emails, social media, linkedIn. No employee shall, directly or indirectly, engage himself, without prior written permission of the Managing Director, in any business, trade or profession other than this employment. In the event, written permission given, the employee will assure and ensure faithfully and diligent service to the company entrusted to him at all times. 3. Services of an employee shall be liable to be transferred to any office of the company located anywhere in Bangladesh at the discretion of the management of the company. An employee may be required to work in any department/section/unit", "service to the company entrusted to him at all times. 3. Services of an employee shall be liable to be transferred to any office of the company located anywhere in Bangladesh at the discretion of the management of the company. An employee may be required to work in any department/section/unit as per decision of the management without adversely affecting his/her salaries and other service conditions. 4. An employee shall neither be absent from his/her duties nor leave the station without informing his/her departmental senior. The employee shall inform the Company as soon as possible but by no more than three days of his absence through any available means in case of sudden sickness or accident or any unavoidable reason. He/she must keep the Company informed of his latest address. 5. Employees are to devote their whole working time and attention to the discharge of their duties, to keep secret all confidential information imparted to them and to surrender, on termination/discharge etc.", "or any unavoidable reason. He/she must keep the Company informed of his latest address. 5. Employees are to devote their whole working time and attention to the discharge of their duties, to keep secret all confidential information imparted to them and to surrender, on termination/discharge etc. of employment or otherwise any possession relating to the Company’s business. 6. No employee shall take part in any activity in a manner contrary to the vision/ideas/ instruction/source code of the company.", "7. No employee shall contribute to any press, radio, television, organization nor shall make public or publish any document, paper or information of the Company which may come into his/her custody or possession, without prior written order of Managing Director. 8. No employee shall sign any business, contract or document making any financial commitment on behalf of the Company unless he/she is specifically authorized to do so. 9. No consideration or perquisite may be offered, solicited or accepted by any employee in the course of his/her duties without the knowledge of the Company management. 10. No employee shall, during his/her employment or after its termination, discloses to any person any information relating to the Company or its clients or any trade secrets, which have come to his knowledge while in the service of the Company except when compelled to do so by a Court of Law. 11. In the date of resign employee should must hand over all the assigned inventory, intellectual", "any information relating to the Company or its clients or any trade secrets, which have come to his knowledge while in the service of the Company except when compelled to do so by a Court of Law. 11. In the date of resign employee should must hand over all the assigned inventory, intellectual property and others assets to company for getting release order from HR & Accounts. Note: Mediusware Management reserves the right to change, update, and modify this guideline at any time.", "ClickUp SOP - Mediusware 1. Purpose This Standard Operating Procedure (SOP) defines the software development workflow at Mediusware Limited, using ClickUp as the central project management tool. It outlines how each stakeholder—including Management, CTO, Project Managers, Business Analysts, Developers, QA Engineers, and Designers—utilizes ClickUp to support structured planning, effective collaboration, accountability, progress tracking, and quality software delivery. The SOP is designed to establish consistency, improve efficiency, and ensure high-quality outcomes throughout the software development lifecycle. 2. Project Kickoff 2.1 Pre-Kickoff Preparation ●​ Review and approval of Statement of Work (SOW) ●​ Finalized contract and signed NDA ●​ Initial requirements gathered from the client or discovery ●​ Tool and account access setup for ClickUp, Git, Slack, and others ●​ Creation of project folder and structure in ClickUp ●​ Resource allocation and team assignment 2.2 Defined Roles", "of Work (SOW) ●​ Finalized contract and signed NDA ●​ Initial requirements gathered from the client or discovery ●​ Tool and account access setup for ClickUp, Git, Slack, and others ●​ Creation of project folder and structure in ClickUp ●​ Resource allocation and team assignment 2.2 Defined Roles and Responsibilities ●​ Client Experience Manager: Primary contact for all communications and managerial approvals ●​ Technical Project Manager (TPM): Oversees planning, reporting, and execution ●​ Business Analyst (BA): Handles requirement gathering and documentation ●​ Lead Dev/Tech Lead / CTO: Provides technical direction and code review ●​ Developers: Responsible for implementation ●​ QA Lead: Manages quality assurance and test coverage ●​ UI/UX Designer: Delivers design assets and specifications 2.3 Project Scope and Goals ●​ Creating a Work Breakdown Structure (WBS) based on Project Scope and Goals by defining key deliverables, features, and modules. ●​ Confirm project timelines and", "Manages quality assurance and test coverage ●​ UI/UX Designer: Delivers design assets and specifications 2.3 Project Scope and Goals ●​ Creating a Work Breakdown Structure (WBS) based on Project Scope and Goals by defining key deliverables, features, and modules. ●​ Confirm project timelines and deadlines ●​ Set acceptance criteria ●​ Establish budget and resource constraints ●​ Identify key success metrics", "2.4 Tool Setup ●​ ClickUp: Task management, Docs, dashboards ●​ Slack/Email: Communication ●​ Google Drive/Notion: Documentation and asset sharing ●​ GitHub/GitLab: Version control ●​ Figma/Adobe XD: Design delivery 2.5 Kickoff Meeting Agenda ●​ Introductions and team roles ●​ Project goals and vision ●​ Review of deliverables, scope, and limitations (to align on what will and will not be delivered) ●​ Setting expectations and managing out-of-scope requests ●​ Tool access and communication plan ●​ Timelines and key milestones ●​ Assignment of immediate next steps 3. ClickUp Project Structure Overview 3.1 Hierarchy: Spaces > Folders > Lists > Tasks ClickUp uses a hierarchical structure that ensures clarity and separation of concerns across projects and departments. 3.2 Standard Structure Space: Client Projects​ Folder: [Project Name] - [Client Name]​ Lists: ●​ Sprint Backlog ●​ Sprint 0 - Setup ●​ Sprint 1, Sprint 2, etc. ●​ Design ●​ QA & UAT ●​ Documentation ●​ Bugs & Issues ●​", "that ensures clarity and separation of concerns across projects and departments. 3.2 Standard Structure Space: Client Projects​ Folder: [Project Name] - [Client Name]​ Lists: ●​ Sprint Backlog ●​ Sprint 0 - Setup ●​ Sprint 1, Sprint 2, etc. ●​ Design ●​ QA & UAT ●​ Documentation ●​ Bugs & Issues ●​ Retrospectives 3.3 Supporting Spaces (Optional) ●​ Client Management: For client onboarding, communication logs, change requests ●​ UI/UX Design: To manage design workflows and handoffs with developers ●​ QA & Testing: Centralized QA test cases, regression logs, and release readiness 3.4 Task Details Tasks can include: ●​ Subtasks ●​ Custom Fields: Priority, Story Points, Status, Assignee ●​ Dependencies and relationships", "●​ Linked Docs, Design files, Test Cases ●​ Time estimates and logs 3.5 Views and Automation ●​ Board View: Visual kanban style workflow ●​ List View: Task-level detail and filtering ●​ Gantt View: Timeline-based planning ●​ Docs View: Embedded or linked documents ●​ Dashboards: Custom reporting for PMs and Executives Use automation to assign tasks, update statuses, notify stakeholders, and more to enhance productivity and reduce human error. 4. Sprint Planning and Estimation Guide 4.1 Sprint Planning Process ●​ Conducted at the start of every sprint (typically bi-weekly) ●​ Involves TPM, BA, Developers, QA, and optionally CTO 4.2 Planning Steps 1.​ Define Ideal Customer Profile (ICP) to align features with target users 2.​ Create and refine user stories based on ICP and project goals 3.​ Review backlog and prioritize user stories 4.​ Define sprint goal and team capacity 5.​ Select stories based on priority and capacity 6.​ Add detailed acceptance criteria to each story 7.​ Estimate", "features with target users 2.​ Create and refine user stories based on ICP and project goals 3.​ Review backlog and prioritize user stories 4.​ Define sprint goal and team capacity 5.​ Select stories based on priority and capacity 6.​ Add detailed acceptance criteria to each story 7.​ Estimate effort using story points or hours 8.​ Assign tasks and subtasks to team members 9.​ Link relevant documentation, designs, and test cases 4.3 Estimation Guidelines ●​ Review past team performance and task complexity ●​ Ensure developers and QA provide joint input ●​ Include buffer for testing, bugs, and code review ●​ For projects or milestone estimates, get approval from the CTO before sending to the client. 4.4 ClickUp Configuration ●​ Create Sprint List or Folder ●​ Use custom fields: Story Points, Priority, Assignee ●​ Add Sprint Start/End dates ●​ Set up views: Board View (by status), List View (by assignee), Gantt Chart (for dependencies)", "5. QA and Release Protocols 5.1 QA Workflow ●​ Developers move tasks to \"Ready for QA\" list and also change status of a task to “QA Ready” when development is complete. ●​ QA team reviews task description, acceptance criteria, and related documents. ●​ QA performs one or more of the following: ○​ Manual testing based on acceptance criteria. ○​ Automated test execution (if applicable). ○​ UI/UX consistency check against design files. ○​ Functional and regression testing. ●​ Any bugs found are logged as subtasks or linked tasks with proper classification. ●​ QA updates status to: ○​ Tested – if passed successfully. ○​ Rejected – if critical issues are found. The task is reassigned to the original developer. ●​ Developers resolve issues and resubmit to \"Ready for QA\". ●​ The cycle repeats until approval. 5.2 Bug Reporting Standards ●​ Clear title and description ●​ Steps to reproduce ●​ Expected vs. actual result ●​ Environment (Dev, QA, Staging, Production) ●​ Severity level ●​", "the original developer. ●​ Developers resolve issues and resubmit to \"Ready for QA\". ●​ The cycle repeats until approval. 5.2 Bug Reporting Standards ●​ Clear title and description ●​ Steps to reproduce ●​ Expected vs. actual result ●​ Environment (Dev, QA, Staging, Production) ●​ Severity level ●​ Screenshots or logs if applicable 5.3 QA Reporting ●​ QA Dashboard with open vs. closed bugs, pass/fail rate, and velocity ●​ End-of-sprint QA report shared via ClickUp Doc 5.4 Release Protocol ●​ Ensure all tasks in \"Tested\" list are linked to the release version ●​ Attach release notes in ClickUp ●​ Perform sanity check in staging ●​ Obtain sign-off from TPM/CTO ●​ Deployment executed by DevOps or Tech Lead ●​ Move all tasks to \"Released/Completed.\" ●​ Notify stakeholders with release notes ●​ After release, notify Operations to proceed with payment processing—include reported information such as total duration, hours worked, and any relevant summary for invoicing. 5.5 Release Notes", "or Tech Lead ●​ Move all tasks to \"Released/Completed.\" ●​ Notify stakeholders with release notes ●​ After release, notify Operations to proceed with payment processing—include reported information such as total duration, hours worked, and any relevant summary for invoicing. 5.5 Release Notes Template ●​ Version number ●​ Release date ●​ Features delivered ●​ Bugs fixed", "●​ Known issues 6. Client Communication Cadence 6.1 Communication Schedule Type Frequency Owner Format Weekly Progress Report Weekly (Friday) Technical Project Manager ClickUp + Email Client Sync Call Bi-weekly TPM + BA Zoom + ClickUp Sprint Demo End of Sprint TPM + Dev + QA Live Demo + Doc Monthly Executive Summary Monthly TPM + CTO ClickUp Doc or PDF Ad-Hoc Escalations As needed TPM or CTO Email or Call 6.2 Weekly Progress Report Content ●​ % completion vs plan ●​ Completed, ongoing, and blocked tasks ●​ Key decisions needed ●​ Priorities for the next week 6.3 Monthly Executive Summary ●​ Milestone progress ●​ Budget utilization ●​ Risks and mitigations ●​ Roadmap preview 6.4 Communication Tools ●​ ClickUp: Project status, Docs, dashboards ●​ Email: Formal updates ●​ Zoom/Google Meet: Client meetings ●​ Slack: (If used with client) Ad-hoc updates 7. Post-Mortem / Retrospective Template 7.1 Purpose To reflect on the sprint, identify what worked well, what didn’t, and how to improve", "Tools ●​ ClickUp: Project status, Docs, dashboards ●​ Email: Formal updates ●​ Zoom/Google Meet: Client meetings ●​ Slack: (If used with client) Ad-hoc updates 7. Post-Mortem / Retrospective Template 7.1 Purpose To reflect on the sprint, identify what worked well, what didn’t, and how to improve future sprints. 7.2 Sprint Info ●​ Sprint Name and Dates", "●​ Team Members Involved ●​ Sprint Goal 7.3 Metrics Summary ●​ Planned vs. completed tasks ●​ Spillover ●​ Bugs reported and resolved ●​ Velocity 7.4 Retrospective Structure What Went Well ●​ List of wins and successful practices What Didn’t Go Well ●​ Bottlenecks or blockers ●​ Missed timelines or quality issues Lessons Learned ●​ Key insights from the team Action Items Action Item Owner Due Date Status Improve estimation accuracy PM [Date] Open Team Feedback (Optional) ●​ Anonymous or open comments 7.5 Documentation ●​ Use ClickUp Doc linked to Sprint Folder ●​ Store retrospectives for future reference ●​ List of all credentials used during the development. ●​ Prepare full feature and technology documentation and guides that can also be used by marketing 8. Conclusion This SOP serves as a guide for all stakeholders involved in Mediusware's software development process. Adhering to these protocols ensures consistent project execution, improved team collaboration, and higher-quality", "documentation and guides that can also be used by marketing 8. Conclusion This SOP serves as a guide for all stakeholders involved in Mediusware's software development process. Adhering to these protocols ensures consistent project execution, improved team collaboration, and higher-quality deliverables. All teams are expected to regularly review and refine their use of ClickUp to maintain optimal performance and alignment with company standards."]